Show / Hide Table of Contents
Interface IGrpcMessageHandler
Non generic implementation of IGrpcMessageHandler<T>
Namespace: IdeaStatiCa.Plugin.Grpc
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public interface IGrpcMessageHandler
Methods
Improve this Doc   View Source
HandleClientMessage(GrpcMessage, GrpcClient)
Handles response incoming from the server.
Declaration
Task<object> HandleClientMessage(GrpcMessage message, GrpcClient client)
Parameters
 Type |  Name |  Description
 GrpcMessage |  message
Message sent by server.
 GrpcClient |  client
Returns
 Type |  Description
 System.Threading.Tasks.Task<System.Object>
Improve this Doc   View Source
HandleServerMessage(GrpcMessage, GrpcServer)
Handles request incoming from the client.
Declaration
Task<object> HandleServerMessage(GrpcMessage message, GrpcServer server)
Parameters
 Type |  Name |  Description
 GrpcMessage |  message
Message sent by client.
 GrpcServer |  server
Returns
 Type |  Description
 System.Threading.Tasks.Task<System.Object>
 Improve this Doc
 View Source